[{"title": "Affine sets and affine hulls", "label": "pm-es-affineHullProblem", "tags": ["Ensemble spaces", "Convex spaces", "Affine spaces"], "description": "In the context of ensemble spaces, we have defined closures in terms of convex combinations. It may be useful to also define closures in terms of affine combinations. It needs to be understood whether this is useful, and how to make sure that these closures work for infinite dimensional spaces."}, {"title": "Classicality as reducibility", "label": "pm-es-reducibility", "tags": ["Ensemble spaces", "Convex spaces"], "description": "We still need a solid characterization of the ensemble space for classical theories. Effectively, we are looking for a characterization of a convex space to be a symplex without extreme points, such that the extreme points can be understood as limits, and not elements of the convex space."}, {"title": "Classical contexts", "label": "pm-es-classicalContexts", "tags": ["Ensemble spaces", "Convex spaces"], "description": "Even if an ensemble space is not classical, we want to be able to characterize subsets of ensembles spaces that look classical. In quantum mechanics, this would recover the contexts in which classical probability can be defined"}, {"title": "Topological Measures", "label": "pm-es-topologicalMeasures", "tags": ["Topology", "Measure theory"], "description": "We still need to understand what requirements a measure must satisfy to describe a well-posed physical problem. The issue is that the set of all probability measures defined over a space is too broad, but it is not clear how it should be restricted. There must be a link between the underlying experimental verifiability that motivates topologies and the possible outputs associated to the procedures that are connected to the measures."}, {"title": "Spectrum of a quantity", "label": "pm-es-quantitySpectrum", "tags": ["Ensemble spaces", "Spectral theory", "Topological vector spaces", "Order theory"], "description": "We are looking for a definition of the spectrum of a quantity (i.e. linear functional) that can be defined for a general ensemble space (i.e. convex space). It would already be helpful to establish whether the entropic structure is required, or whether the convex structure is sufficient."}, {"title": "Conditional expectation values", "label": "pm-es-expectations", "tags": ["Ensemble spaces", "Probability", "Non-additive measures"], "description": "There should be a way to generalize the notion of conditional expectation to a generic ensemble space. The general idea should be that, given a target ensemble and a set of ensembles, we find the biggest component of the target that is a mixture of ensembles of the set. The expectation of a quantity for the target ensemble restricted to that set would be the quantity evaluated on the representative. In classical probability, it would recover the expectation of a random variable conditioned to an event."}, {"title": "Ensemble subspaces", "label": "pm-es-ensembleSubspaces", "tags": ["Ensemble spaces", "convex spaces"], "description": "We should create a notion of ensemble subspaces that recovers those of classical and quantum mechanics. In classical probability, each event identifies the subspace of probability measures whose support is within that even. In quantum mechanics, each subspace of the Hilbert space identify a subspace of density operators that can be defined on that subspace alone."}, {"title": "Ensemble space composition", "label": "pm-es-composition", "tags": ["Ensemble spaces", "convex spaces"], "description": "We need a definition for composite systems that takes two ensemble spaces and create the product. The issue is that it is unclear whether this can be a single definition, as product spaces for classical ensembles and quantum ensembles are different. Note, however, that the additional structure given by the entropy and, potentially, by the missing Lie algebraic structure may fill the gaps."}, {"title": "Poisson structure over ensemble spaces", "label": "pm-es-poissonStructure", "tags": ["Ensemble spaces", "Poisson structure", "Lie algebras"], "description": "Both classical and quantum mechanics contain a Poisson/symplectic structure implemented by Poisson brackets and commutators. We need to be able to generalize this structure on ensemble spaces, without reference to the classical and quantum implementation. The goal would be to write generalized Hamiltonian equations that work in both cases."}]
[{"title": "Extend the classical uncertainty principle", "label": "rp-cm-extendClassicalUncertainty", "tags": ["Classical mechanics", "Poisson brackets", "Symplectic group", "Statistics", "Information theory"], "description": "Currently, the classical uncertainty principle is fully worked out for canonical variables of a single DOF. We would like to generalize the expression for non-canonical variables, relating it to the Poisson brackets, and to multiple DOF."}, {"title": "Find a geometric characterization for $G_{\\alpha\\beta\\gamma}$", "label": "rp-cm-geometricInterpretationOfG", "tags": ["Classical mechanics", "Differential geometry", "Riemmanian geometry", "General relativity"], "description": "In \\ref{rp-cm-emTensorAndInertialPseudotensor} we have found that the pseudo-tensor $G_{\\alpha\\beta\\gamma} = \\partial_{x^\\alpha} g_{\\beta \\gamma} - \\partial_{x^\\beta} g_{\\alpha \\gamma}$ plays a fundamental role in connecting the symplectic form (and therefore the geometry/entropy of classical mechanics) to the geometry of space-time. We still lack a good geometric and physical understanding of that object."}, {"title": "How much of general relativity is already in particle dynamics", "label": "rp-cm-linkBetweenEmAndG", "tags": ["Classical mechanics", "Differential geometry", "Riemmanian geometry", "General relativity"], "description": "In \\ref{rp-cm-emHamiltonianConstraintDerivation} we have derived the equation for massive particles under gravitational and electromagnetic fields. It still needs to be understood whether the two fields can be chosen independently or they must satisfy some relationships, which may lead to a hint of general relativity in particle mechanics."}, {"title": "Special relativity as a theory of integration", "label": "rp-cm-relativityAsIntegraion", "tags": ["Classical mechanics", "Riemannian geometry", "Measure theory"], "description": "See how much of special relativity can be recovered simply by positing normalization of probability over space across coordinate transformations."}, {"title": "Classical relativistic directional DOF (Classical spin analogue)", "label": "rp-cm-classicalRelatisticSpin", "tags": ["Classical mechanics", "Quantum mechanics", "Spin", "Hamiltonian mechanics", "Symplectic geometry"], "description": "While we have worked out a non-relativistic direction DOF, we have not worked out a relativistic one. Another way to look at the same problem is work out a classical analogue of a spin 1/2 system."}]
